#include"stdafx.h"
#include "PrimitivePutRouxTask.h"

using namespace htn;

//==================================================
// コンストラクタ
//==================================================
PrimitivePutRouxTask::PrimitivePutRouxTask()
{
}

//==================================================
// デストラクタ
//==================================================
PrimitivePutRouxTask::~PrimitivePutRouxTask()
{
}

//==================================================
// 開始
//==================================================
void PrimitivePutRouxTask::start()
{
	printf("そろそろルーを入れよう\n");
}

//==================================================
// 更新
//==================================================
void PrimitivePutRouxTask::update()
{
	printf("ルーを入れる\n");
}

//==================================================
// 終了
//==================================================
void PrimitivePutRouxTask::end()
{
	printf("ルーを入れましたカレーの完成です。\n");
}

//==================================================
// コスト取得
//==================================================
float PrimitivePutRouxTask::getCost()
{
	return 1;
}

//==================================================
// プリミティブタスクか（falseは階層型タスク）
//==================================================
bool PrimitivePutRouxTask::isPrimitive()
{
	return true;
}

//==================================================
// 前条件を満たしているか
//==================================================
bool PrimitivePutRouxTask::evaluatePreCondition(HtnState* state)
{
	if (state->isBoil() && !state->isPutRoux())
	{
		return true;
	}
	return false;
}

//==================================================
// ステータスを変更する
//==================================================
void PrimitivePutRouxTask::changeStatus(HtnState* state)
{
	state->setPutRoux(true);
}

//==================================================
// タスクが終了したか
//==================================================
bool PrimitivePutRouxTask::isFinish()
{
	return true;
}
