#include"stdafx.h"
#include "PrimitiveGoTask.h"

using namespace htn;

//==================================================
// コンストラクタ
//==================================================
PrimitiveGoTask::PrimitiveGoTask()
{
}

//==================================================
// デストラクタ
//==================================================
PrimitiveGoTask::~PrimitiveGoTask()
{
}

//==================================================
// 開始
//==================================================
void PrimitiveGoTask::start()
{
	printf("GoStart\n");
}

//==================================================
// 更新
//==================================================
void PrimitiveGoTask::update()
{
	printf("-----------------\nGOOOOOO!!!\n-----------------\n");
}

//==================================================
// 終了
//==================================================
void PrimitiveGoTask::end()
{
	printf("GoEndt\n");
}

//==================================================
// コスト取得
//==================================================
float PrimitiveGoTask::getCost()
{
	return 1;
}

//==================================================
// プリミティブタスクか（falseは階層型タスク）
//==================================================
bool PrimitiveGoTask::isPrimitive()
{
	return true;
}

//==================================================
// 前条件を満たしているか
//==================================================
bool PrimitiveGoTask::evaluatePreCondition(HtnState* state)
{
	if (!state->getA())
	{
		return true;
	}
	return false;
}

//==================================================
// ステータスを変更する
//==================================================
void PrimitiveGoTask::changeStatus(HtnState* state)
{

	state->setA(true);
}

//==================================================
// タスクが終了したか
//==================================================
bool PrimitiveGoTask::isFinish()
{
	return true;
}
